20220621/InformationRegisters/тм_ПраваДоступа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>тм_ПраваДоступа</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Чтение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Запись</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>SA</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

20220621/InformationRegisters/тм_ПраваДоступа/Ext/ManagerModule.bsl
Процедура ЗаписатьВыбранныеЗначения(ВыбранноеЗначение) Экспорт
	
	ВыбранныеПользователи = ВыбранноеЗначение.Пользователи;
	Объекты = СтрРазделить(ВыбранноеЗначение.Объекты, ",", Ложь);
	
	Для каждого Пользователь Из ВыбранныеПользователи Цикл
						
		Для каждого ОбъектЗаписи Из Объекты Цикл
			МЗ = СоздатьМенеджерЗаписи();
			МЗ.Пользователь = Пользователь;
			МЗ.Объект 		= ОбъектЗаписи;
			МЗ.Запись		= ВыбранноеЗначение.Запись;
			МЗ.Чтение		= ВыбранноеЗначение.Чтение;
			МЗ.SA			= ВыбранноеЗначение.SA;			
			МЗ.Записать();
		КонецЦикла;  
		
	КонецЦикла;  
		
КонецПроцедуры // ЗаписатьВыбранныеЗначения()
